{
  "blogs": [
    {
      "title": "Biscotti",
      "body": "Biscotti, known also as cantucci, are Italian almond biscuits that originated in the Tuscan city of Prato.",
      "author": " Dan",
      "id": 1,
      "ingredients": "\n350g plain flour plus extra for rolling,\n 2 tsp baking powder,\n 2 tsp mixed spice,\n 250g golden caster sugar,\n 3 eggs, beaten,\n coarsely grated zest 1 orange,\n 85g raisin,\n85g dried cherry,\n50g blanched almond,\n50g shelled pistachio",
      "instructions": "STEP 1\n Heat oven to 180C/fan 160C/gas 4.\n Line 2 baking sheets with baking paper. Put the flour, baking powder, spice and sugar in a large bowl, then mix well. Stir in the eggs and zest until the mixture starts forming clumps, then bring the dough together with your hands – it will seem dry at first but keep kneading until no floury patches remain. Add the fruit and nuts, then work them in until evenly distributed.\n\nSTEP 2\n Turn the dough out onto a lightly floured surface and divide into 4 pieces. With lightly floured hands, roll each piece into a sausage about 30cm long. Place 2 on each tray, well spaced apart. Bake for 25-30 mins until the dough has risen and spread and feels firm. It should still look pale. Remove from the oven, transfer to a wire rack for a few mins until cool enough to handle, then turn down the oven to 140C/fan 120C/gas 1.\n\nSTEP 3 \nUsing a bread knife, cut into slices about 1cm thick on the diagonal, then lay the slices flat on the baking sheets. The biscuits can be cooled and frozen flat on the sheet at this point, then bagged and frozen for up to 2 months. Bake for another 15 mins (20 mins if from frozen), turn over, then bake again for another 15 mins until dry and golden. Tip onto a wire rack to cool completely, then store in an airtight tin for up to one month, or pack into boxes or cellophane bags if giving as gifts straightaway.",
      "image":"https://bojongourmet.com/wp-content/uploads/2019/12/Gluten-Free-Biscotti-with-Hazelnuts-and-Chocolate-12.jpg"
    },
    {
      "title": "Christmas Fudge",
      "body": "Make a festive fudge with orange zest, dried fruit and spices for the Christmas season. It is ideal wrapped up as a gift – or a treat to yourself!",
      "author": "Alex",
      "id": 2,
      "ingredients": "\nCooking spray\n 480 g chocolate chips \n1 (400g) can sweetened condensed milk \n2 tbsp. double cream \n4 tbsp. butter \n1 tsp. vanilla extract \n1/4 tsp. salt \n3 tbsp. Christmas sprinkles",
      "instructions": "STEP 1\nLine an 20cm square baking tin with parchment paper and grease with cooking spray. In a medium saucepan over medium heat, melt chocolate, condensed milk, butter, cream, vanilla, and salt together. Stir until smooth then pour into prepared pan.\n\nSTEP 2\nTop with sprinkles and refrigerate until set, 2 hours. Cut into squares to serve. ",
      "image":"https://tmbidigitalassetsazure.blob.core.windows.net/rms3-prod/attachments/37/1200x1200/My-Christmas-Fudge_exps80712_TH133086B08_06_1bC_RMS.jpg"
    },
    {
      "title": "Cookies",
      "body": "Cookies make the perfect rainy afternoon treat. From gooey American chocolate chip cookies to melty shortbread, we have got a biscuit selection to please everyone.",
      "author": "Dan",
      "ingredients": "\n\n½ cup granulated sugar(100 g) \n¾ cup brown sugar(165 g), packed\n1 teaspoon salt\n½ cup unsalted butter(115 g), melted\n1 egg\n1 teaspoon vanilla extract\n1 ¼ cups all-purpose flour(155 g)\n½ teaspoon baking soda\n4 oz milk or semi-sweet chocolate chunks(110 g)\n4 oz dark chocolate chunk(110 g), or your preference",
      "instructions": "STEP 1\nIn a large bowl, whisk together the sugars, salt, and butter until a paste forms with no lumps.\n\nSTEP 2\nWhisk in the egg and vanilla, beating until light ribbons fall off the whisk and remain for a short while before falling back into the mixture.\n\nSTEP 3\nSift in the flour and baking soda, then fold the mixture with a spatula (Be careful not to overmix, which would cause the gluten in the flour to toughen resulting in cakier cookies).\n\nSTEP 4\nFold in the chocolate chunks, then chill the dough for at least 30 minutes. For a more intense toffee-like flavor and deeper color, chill the dough overnight. The longer the dough rests, the more complex its flavor will be.\n\nSTEP 5\nPreheat oven to 350°F (180°C). Line a baking sheet with parchment paper.\n\nSTEP 6\nScoop the dough with an ice-cream scoop onto a parchment paper-lined baking sheet, leaving at least 4 inches (10 cm) of space between cookies and 2 inches (5 cm) of space from the edges of the pan so that the cookies can spread evenly.\n\nSTEP 7\nBake for 12-15 minutes, or until the edges have started to barely brown.\n\nSTEP 8\n Cool completely before serving and enjoy!",
      "id": 3,
      "image":"https://www.livewellbakeoften.com/wp-content/uploads/2020/08/Small-Batch-Chocolate-Chip-Cookies-4s.jpg"
    },
    {
      "title": "Gingerbread",
      "body": "This easy gingerbread recipe is great for baking with children, and it makes a lovely homemade Christmas present. Make gingerbread men or any other shape!",
      "author": "Dan",
      "ingredients": "\n\n225g plain flour, plus extra for dusting\n½ tsp salt\n2 tsp bicarbonate of soda\n1 heaped tsp ground ginger\n½ tsp cinnamon\n50g unsalted butter\n100g soft brown sugar\n100g golden syrup",
      "instructions": "STEP 1\nHeat oven to 190C/170C fan/gas 5 and line a baking tray with baking parchment. Sieve the flour, salt, bicarb, ginger and cinnamon into a large bowl. Heat the butter, sugar and syrup until dissolved. Leave the sugar mixture to cool slightly, then mix into the dry ingredients to form a dough. Chill the dough in the fridge for 30 mins.\n\nSTEP 2\nOn a surface lightly dusted with flour, roll out the dough to a ¼-inch thickness. Stamp out the gingerbread men shapes with a cutter, then re-roll any off-cuts and repeat. Place your gingerbread shapes on the lined trays, allowing space for them to spread. Cook for 10-15 mins, then remove from the oven and leave to cool.",
      "id": 4,
      "image":"https://www.momlovesbaking.com/wp-content/uploads/2020/12/Soft-Chewy-Gingerbread-Men-Cookies-SQ.jpg"
    },
    {
      "title": "Pinwheel Cookies",
      "body": "Your Christmas cookie game is about to be strong. These easy pinwheel cookies are beyond mesmerising but also so easy to make.",
      "author": "Alex",
      "ingredients": "\n\n280 g plain flour\n1 tsp. baking powder\n1/2 tsp.  salt\n225 g butter, softened\n200 g caster sugar\n1 large egg\n3/4 tsp. almond extract\nRed food colouring\nSprinkles",
      "instructions": "STEP 1\nIn a medium bowl, whisk together flour, baking powder, and salt. In a large bowl using a hand mixer (or in the bowl of a stand mixer, fitted with a paddle attachment), beat butter and sugar together. Add egg and beat until incorporated, then add extract. Add dry ingredients and beat until just combined. \n\nSTEP 2\nDivide dough in half, keeping one half in mixing bowl. Add red food colouring and mix until desired colour is reached. Shape each dough into a square that is roughly 1.5-cm thick. Wrap in cling film and refrigerate until firm, about 30 minutes. \n\nSTEP 3\nPlace red dough between two sheets of parchment paper and roll into a rectangle that’s about 1/2-cm thick. Repeat with white dough. Take top sheet of parchment paper off of each dough. Place red dough on top of white dough, dough sides facing each other. Gently press on top of dough to help seal together. \n\nSTEP 4\nRemove top parchment paper and trim sides to match up evenly. Starting on a long side, use the bottom parchment paper to help roll dough tightly in to a log. Roll log on the counter a few times to help seal the edge. Wrap in cling film and refrigerate until firm, at least 1 hour and up to overnight. \n\nSTEP 5\nPreheat oven to 180°C (160ºC fan). Line 2 large baking trays with parchment paper. Place sprinkles on a medium plate. Using a sharp knife, slice cookies 1.5-cm thick and roll edges in sprinkles. Place on baking trays 5-cm apart. \n\nSTEP 6\nBake until edges are set and just starting to turn golden, 10 minutes. ",
      "id": 5,
      "image":"https://www.simplyrecipes.com/thmb/0lv--9fvZkx2vBiTw2Oh6xGlv1g=/1777x1333/smart/filters:no_upscale()/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2017__11__2017-11-18-Holiday-Pinwheel-Cookies-COLORADJUSTED-3-d7e0e36ac8f548dfa5b1eaac4b797984.jpg"
    }
  ]
}